## Python statistics essential training - 02_05_challenge

Standard imports

In [1]:
import numpy as np
import pandas as pd

import matplotlib
import matplotlib.pyplot as pp

%matplotlib inline

In [79]:
mapping = {
'04':'0-4',
'514':'5-14',
'014':'0-4',
'1524':'15-24',
'2534':'25-34',
'3544':'35-44',
'4554':'45-54',
'5564': '55-64',
'65':'65+',
'u':'nan'    
}

In [80]:
data = pd.read_csv ("tb.csv")

In [81]:
data.columns

Index(['country', 'year', 'm04', 'm514', 'm014', 'm1524', 'm2534', 'm3544',
       'm4554', 'm5564', 'm65', 'mu', 'f04', 'f514', 'f014', 'f1524', 'f2534',
       'f3544', 'f4554', 'f5564', 'f65', 'fu'],
      dtype='object')

In [82]:

data = pd.melt(data, ['country', 'year'], ['m04', 'm514', 'm014', 'm1524', 'm2534', 'm3544',
       'm4554', 'm5564', 'm65', 'mu', 'f04', 'f514', 'f014', 'f1524', 'f2534',
       'f3544', 'f4554', 'f5564', 'f65', 'fu'], "sex-age", "cases")

In [83]:

data['age'] = data['sex-age'].map(lambda s: s[1:])
data['sex'] = data['sex-age'].apply(lambda s: s[0]) 
data = data.dropna(subset = ['cases'])
data.head()

   country  year sex-age  cases age sex
15      AD  2005     m04    0.0  04   m
16      AD  2006     m04    0.0  04   m
18      AD  2008     m04    0.0  04   m
42      AE  2006     m04    0.0  04   m
43      AE  2007     m04    0.0  04   m

In [84]:

data['age'] = data['age'].map(mapping)
data = data[['country','year','age','sex', 'cases']]
data.sort_values(['country','year','age','sex'], inplace = True)
data.head()

      country  year    age sex  cases
69234      AD  1996    0-4   f    0.0
11544      AD  1996    0-4   m    0.0
75003      AD  1996  15-24   f    1.0
17313      AD  1996  15-24   m    0.0
80772      AD  1996  25-34   f    1.0

In [40]:
final = pd.read_csv("final.csv")
final['age'].unique()

array(['15-24', '25-34', '35-44', '45-54', '55-64', '65+', nan, '0-4',
       '5-14'], dtype=object)

In [55]:
final.sort_values(['country', 'year'], inplace = True)
final

      country  year    age sex  cases
0          AD  1996  15-24   f    1.0
2          AD  1996  25-34   f    1.0
3          AD  1996  25-34   m    0.0
4          AD  1996  35-44   f    0.0
5          AD  1996  35-44   m    4.0
...       ...   ...    ...  ..    ...
35745     NaN  2008    65+   m  132.0
35746     NaN  2008    NaN   f   73.0
35747     NaN  2008    NaN   f    0.0
35748     NaN  2008    NaN   m   30.0
35749     NaN  2008    NaN   m    0.0

[35750 rows x 5 columns]